In [3]:
import numpy as np
import pandas as pd

In [4]:
matris = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(matris, columns=["variable_1","variable_2","variable_3"])
df

   variable_1  variable_2  variable_3
0          16           2           6
1           3          26          15
2          26          16           3
3           9          24          25
4          22          26          17
5          25           3          22
6           4          24          24
7          14          18           1
8          15          23          19
9          16          26          13

In [11]:
#To see only variable_1 columns with it's all rows.
df["variable_1"]

0    16
1     3
2    26
3     9
4    22
5    25
6     4
7    14
8    15
9    16
Name: variable_1, dtype: int32

In [15]:
#To see 
#variable_1 & variable_2 columns 
#with 0rd & 1rd Rows.
df[0:2][["variable_1","variable_2"]]
#note: This technique is called by 'fancy' method (calling columns)

   variable_1  variable_2
0          16           2
1           3          26

In [18]:
#We can see the variable_1 column.
df.variable_1

0    16
1     3
2    26
3     9
4    22
5    25
6     4
7    14
8    15
9    16
Name: variable_1, dtype: int32

In [24]:
#The Variable_2 Column's Values 
#if the Variable_1 Column's Value > 15 
#we'll see the Variable 2 Column's Value
#in same row.
df[df.variable_1 > 15]["variable_2"]

0     2
2    16
4    26
5     3
9    26
Name: variable_2, dtype: int32

In [28]:
df[(df.variable_1 > 15) & (df.variable_3 < 5)]

   variable_1  variable_2  variable_3
2          26          16           3

In [29]:
#Hasan Baris GOK from Data Manipulation 201 Pandas Directory on GitHub.